rhoEnergyFoam_2.3.x-gpu/tutorials/hit/0/U
 /*--------------------------------*-C++ -*----------------------------------*
 | ========= |
 |       /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
 |  /  O peration | Version:  2.1.1 
 |        A nd    | Web www.OpenFOAM.org |
 |   /     M anipulation  |         
 *----------------------------------------*/
 FoamFile
 {
     version     2.0;
     format      ascii;
     class       volVectorField;
     location  "0"; 
     object      U; 
 }
 // * * * * * * * * * * * * * * * * * * * * * * * //
 dimensions      [0 1 -1 0 0 0 0];
 internalField   nonuniform List<vector> 
 
       32768
 
 (
 (  3.3857904E-03  1.0179351E-03 -3.5708528E-03 )
 ( -1.1739851E-04  3.7211331E-03 -3.1035761E-03 )
 ( -3.1018890E-03  2.4321096E-03 -2.4017473E-03 )
 ( -3.1710104E-03 -8.9132792E-04 -3.7895259E-03 )
 ( -9.7457676E-05 -1.9054384E-03 -6.5111308E-03 )
 (  4.1212458E-03 -5.6332461E-05 -8.2577625E-03 )
 (  6.9504459E-03  5.6284643E-04 -7.4758595E-03 )
 (  7.0695234E-03 -2.8499207E-03 -4.4497391E-03 )
 (  5.0487970E-03 -8.0417050E-03 -1.2586992E-03 )
 (  2.8299671E-03 -1.1088063E-02 -3.6813639E-04 )
 (  2.0557384E-03 -1.0839172E-02 -2.1380384E-03 )
 (  2.5876290E-03 -8.3543714E-03 -3.4270242E-03 )
 (  3.1801225E-03 -4.1660666E-03 -1.3657440E-03 )
 (  3.4146358E-03  1.2870129E-03  1.4608088E-03 )
 (  4.1921576E-03  6.2577552E-03  6.0512323E-04 )
 (  6.5270592E-03  9.0722190E-03 -2.5351564E-03 )
 (  1.0214534E-02  9.3020219E-03 -3.2470955E-03 )
 (  1.3323382E-02  7.4367896E-03 -1.4341517E-03 )
 (  1.3405820E-02  5.2788677E-03 -5.1947212E-04 )
 (  9.9395877E-03  4.7085951E-03 -1.0559461E-03 )
 (  4.8463061E-03  4.4230646E-03 -1.6378764E-04 )
 (  1.8445180E-04  1.3333187E-03  3.2624253E-03 )
 ( -3.3940000E-03 -3.4771154E-03  5.3839930E-03 )
 ( -5.6992578E-03 -4.8830626E-03  2.3894489E-03 )
 ( -6.0950834E-03 -1.0634144E-03 -2.9636510E-03 )
 ( -4.1176430E-03  4.2228065E-03 -4.7530537E-03 )
 ( -5.0311448E-04  7.1572862E-03 -1.7908029E-03 )
 (  2.7600676E-03  7.0489380E-03  2.5341180E-03 )
 (  4.1481070E-03  4.4257222E-03  5.3340965E-03 )
 (  4.3284534E-03  2.3583655E-04  5.4503507E-03 )
 (  4.7680223E-03 -3.0229804E-03  2.6941765E-03 )
 (  5.0236043E-03 -2.6017281E-03 -1.3124860E-03 )
 (  6.9438173E-03 -9.5972398E-05 -2.1067178E-03 )
 (  4.6862136E-03  3.0012038E-03 -8.2512392E-04 )
 (  1.1722249E-03  1.8233393E-03  1.2121990E-03 )
 ( -1.3289704E-03 -1.8667328E-03  1.3772381E-03 )
 ( -1.3077103E-03 -3.3866656E-03 -1.0201968E-03 )
 (  7.1459851E-04 -1.8307288E-03 -4.3299347E-03 )
 (  2.7737180E-03 -1.0669411E-03 -5.8893166E-03 )
 (  3.0977258E-03 -3.4836058E-03 -4.5204749E-03 )
 (  1.3419304E-03 -6.8706051E-03 -1.7980329E-03 )
 ( -1.3904654E-03 -8.4125912E-03 -6.4556731E-04 )
 ( -3.7522975E-03 -7.9592271E-03 -2.6974031E-03 )
 ( -5.1552146E-03 -6.3327150E-03 -6.2000523E-03 )
 ( -5.1721665E-03 -3.4519013E-03 -7.8568617E-03 )
 ( -2.8792296E-03  3.7178365E-04 -7.4003725E-03 )
 (  1.9442705E-03  3.7370385E-03 -6.6350070E-03 )
 (  7.7863499E-03  5.9792860E-03 -4.6968139E-03 )
 (  1.2526786E-02  7.5363140E-03 -1.9060614E-04 )
 (  1.4682475E-02  8.4886272E-03  4.0581082E-03 )
 (  1.3660820E-02  8.6732311E-03  4.4193366E-03 )
 (  1.0200599E-02  8.3243446E-03  2.0109212E-03 )
 (  6.0320501E-03  6.9112489E-03  7.5947103E-04 )
 (  2.1252572E-03  3.0867900E-03  1.6439743E-03 )
 ( -1.6281051E-03 -1.9585618E-03  1.3782057E-03 )
 ( -4.6998514E-03 -3.7882258E-03 -2.2151712E-03 )
 ( -5.5534644E-03 -2.5733493E-04 -5.7813148E-03 )
 ( -3.3020801E-03  5.3903875E-03 -4.8287124E-03 )
 (  1.0441946E-03  8.9995274E-03 -2.3965439E-04 )
 (  4.9284701E-03  9.3099382E-03  3.5513199E-03 )
 (  6.3555315E-03  6.4417901E-03  4.5740823E-03 )
 (  6.0255709E-03  1.1746848E-03  3.7568561E-03 )
 (  6.1106035E-03 -3.4402965E-03  1.7492796E-03 )
 (  7.0007718E-03 -3.7773803E-03 -8.5864187E-04 )
 (  8.3934134E-03 -2.5600551E-03 -7.5536582E-04 )
 (  7.4617201E-03  2.0905538E-03  4.5013434E-04 )
 (  3.7856759E-03  2.9682119E-03  3.5231439E-03 )
 ( -6.4516958E-04  2.6433269E-04  5.6546014E-03 )
 ( -3.2151313E-03 -1.9209945E-03  4.4163018E-03 )
 ( -2.8773686E-03 -1.9096314E-03  2.8985861E-04 )
 ( -8.9285307E-04 -2.0541600E-03 -3.4923169E-03 )
 (  3.4590790E-04 -3.5973652E-03 -4.1705724E-03 )
 ( -7.1355968E-04 -4.6069613E-03 -1.9779850E-03 )
 ( -3.7613241E-03 -3.8364213E-03  1.1495101E-04 )
 ( -7.3029087E-03 -2.6798197E-03 -1.2880341E-03 )
 ( -9.6783517E-03 -2.4720354E-03 -6.3033793E-03 )
 ( -9.1962833E-03 -2.6983523E-03 -1.1111813E-02 )
 ( -4.7060712E-03 -2.3728856E-03 -1.2447496E-02 )
 (  2.6617334E-03 -8.3292101E-04 -9.9180993E-03 )
 (  9.5009655E-03  2.4553931E-03 -3.9521633E-03 )
 (  1.3083041E-02  6.8211523E-03  3.4869681E-03 )
 (  1.3301483E-02  1.0092499E-02  7.6239482E-03 )
 (  1.1458863E-02  1.0694578E-02  5.7771918E-03 )
 (  8.7015005E-03  9.1753006E-03  1.4314126E-03 )
 (  5.7216678E-03  6.6867578E-03 -4.1297532E-04 )
 (  2.6555480E-03  3.0414639E-03  2.9109369E-04 )
 ( -5.9048738E-04 -1.3288261E-03 -3.6190567E-04 )
 ( -3.3525436E-03 -3.2155276E-03 -3.6785821E-03 )
 ( -4.2915060E-03 -4.2368897E-04 -5.8752578E-03 )
 ( -2.7029691E-03  4.5687575E-03 -3.4442185E-03 )
 (  6.2164781E-04  8.1319641E-03  1.5538967E-03 )
 (  3.6301599E-03  9.1062523E-03  4.2354977E-03 )
 (  4.6766605E-03  6.9551780E-03  3.5492280E-03 )
 (  4.4271555E-03  1.4341049E-03  2.2923090E-03 )
 (  4.9588983E-03 -4.5127524E-03  1.5457302E-03 )
 (  6.8582399E-03 -6.1854329E-03  2.7138880E-04 )
 (  5.5794353E-03 -5.9423489E-03 -7.1483193E-04 )
 (  5.9924754E-03  5.1928411E-04 -8.9911897E-05 )
 (  3.6876088E-03  4.9679102E-03  3.0678140E-03 )
...
 );
 boundaryField
 {
     patch0_half0
     {
   type            cyclic;
     }
     patch1_half0
     {
         type            cyclic;
     }
     patch2_half0
     {
         type            cyclic;
     }
     patch2_half1
     {
         type            cyclic;
     }
     patch1_half1
     {
         type            cyclic;
     }
     patch0_half1
     {
         type            cyclic;
     }
 }
